[
    {
        "image": "assets/Car-dealer.png",
        "title": "Car dealer (Buy and Sell)",
        "id": 1,
        "photo_frame": "assets/car-dealer-frame.png",
        "server": "https://github.com/sheikh-riyadh/used-products-resale-server",
        "client": "https://github.com/sheikh-riyadh/used-products-resale-clients",
        "live": "https://car-dealer-7a2f7.web.app/",
        "details": "User role: Admin. Seller. Buyer, Admin: Admin can control all sellers and buyers. If the admin wants to delete a seller or buyer the admin can do it., Seller: If a seller wants to sell his car then the seller must create an account and the seller can advertise his car from the dashboard., Buyer: The buyer can buy the car according to his choice and can see the list of all the cars purchased by him from his dashboard",
        "front_end": "React JS, Tailwind CSS, Daisy UI, Firebase authentication, React router",
        "back_end": "Node JS, Express JS, MongoDB, JWT"
    },
    {
        "image": "assets/repliq-home.png",
        "title": "Fiama eCommerce",
        "id": 2,
        "photo_frame": "assets/repliq.jpeg",
        "server": "https://github.com/sheikh-riyadh/repliq-ecommerce-server",
        "client": "https://github.com/sheikh-riyadh/repliq-ecommerce-client",
        "live": "https://repliq-task.web.app/",
        "details": "In this website users can buy there products and for that user must be create an account for buying products., And there is an admin role. the admin controll all the functionality like: add products delete product. see all users and also see all the products list",
        "front_end": "React JS, Tailwind CSS, Daisy UI, Firebase authentication, React router tanstack query, axios.",
        "back_end": "Node JS, Express JS, MongoDB"
    },
    {
        "image": "assets/quizo.png",
        "title": "Quizo (Learning platform)",
        "id": 3,
        "photo_frame": "assets/quizo-frame.jpeg",
        "server": "https://github.com/sheikh-riyadh/",
        "client": "https://github.com/sheikh-riyadh/quiz-crackerz",
        "live": "https://sheikh-quizo.netlify.app/home",
        "details": "On this website, the user can test her web development knowledge.,There are 4 types of options 1. React JS. 2. javascript. 3. CSS3. 3. GitHub., Users can select options according to their preference., If for some reason the user is not able to answer the question, then he/she can click on the eye icon to give the correct answer",
        "front_end": "React JS, React router, Tailwind CSS, JavaScript, Toast, JSON API",
        "back_end": "null"
    }
]